results/jmeter.log
2026-08-06 07:21:06,202 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-08-06 07:21:06,243 INFO o.a.j.JMeter: Loading user properties from: user.properties
2026-08-06 07:21:06,243 INFO o.a.j.JMeter: Loading system properties from: system.properties
2026-08-06 07:21:06,243 INFO o.a.j.JMeter: Setting System property: claude.api.key=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
2026-08-06 07:21:06,243 INFO o.a.j.JMeter: Setting System property: threads=1
2026-08-06 07:21:06,243 INFO o.a.j.JMeter: Setting System property: rampup=2
2026-08-06 07:21:06,243 INFO o.a.j.JMeter: Setting System property: duration=30
2026-08-06 07:21:06,256 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-08-06 07:21:06,256 INFO o.a.j.JMeter: Version 5.6.3
2026-08-06 07:21:06,256 INFO o.a.j.JMeter: java.version=17.0.20
2026-08-06 07:21:06,256 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2026-08-06 07:21:06,256 INFO o.a.j.JMeter: os.name=Windows 11
2026-08-06 07:21:06,256 INFO o.a.j.JMeter: os.arch=amd64
2026-08-06 07:21:06,256 INFO o.a.j.JMeter: os.version=10.0
2026-08-06 07:21:06,256 INFO o.a.j.JMeter: file.encoding=Cp1252
2026-08-06 07:21:06,256 INFO o.a.j.JMeter: java.awt.headless=true
2026-08-06 07:21:06,256 INFO o.a.j.JMeter: Max memory     =1073741824
2026-08-06 07:21:06,256 INFO o.a.j.JMeter: Available Processors =4
2026-08-06 07:21:06,283 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-08-06 07:21:06,283 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-08-06 07:21:06,283 INFO o.a.j.JMeter: JMeterHome=C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3
2026-08-06 07:21:06,283 INFO o.a.j.JMeter: user.dir  =C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin
2026-08-06 07:21:06,285 INFO o.a.j.JMeter: PWD       =C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin
2026-08-06 07:21:06,289 INFO o.a.j.JMeter: IP: 10.80.0.7 Name: WIN-CA-WKST-64 FullName: host.docker.internal
2026-08-06 07:21:06,326 INFO o.a.j.s.FileServer: Default base='C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin'
2026-08-06 07:21:06,332 INFO o.a.j.s.FileServer: Set new base='C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\scripts'
2026-08-06 07:21:06,745 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-08-06 07:21:06,807 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-08-06 07:21:06,817 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-08-06 07:21:06,823 INFO o.a.j.s.SaveService: Loading file: scripts\sampleRequest.jmx
2026-08-06 07:21:07,010 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-06 07:21:07,012 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-06 07:21:07,012 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-06 07:21:07,012 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-06 07:21:07,012 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-08-06 07:21:07,012 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-08-06 07:21:07,129 INFO o.a.j.JMeter: Creating summariser <summary>
2026-08-06 07:21:07,155 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-08-06 07:21:07,155 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-06 07:21:07,157 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-06 07:21:07,178 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-08-06 07:21:07,178 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-08-06 07:21:07,277 INFO o.a.j.r.ClassFinder: Will scan jar C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-graphs-basic-2.0.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-08-06 07:21:07,290 INFO o.a.j.r.ClassFinder: Will scan jar C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-json-2.7.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-08-06 07:21:07,297 INFO o.a.j.r.ClassFinder: Will scan jar C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-random-csv-data-set-0.8.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-08-06 07:21:07,309 INFO o.a.j.r.ClassFinder: Will scan jar C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-casutg-3.1.1.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-08-06 07:21:07,341 INFO o.a.j.r.ClassFinder: Will scan jar C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-plugins-manager-1.12.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-08-06 07:21:07,691 INFO o.a.j.r.ClassFinder: Will scan jar C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\lib\ext\jmeter-html-report-plugin-1.0.0.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-08-06 07:21:08,286 INFO o.a.j.JMeter: Running test (1786000868286)
2026-08-06 07:21:08,288 INFO o.a.j.e.StandardJMeterEngine: Starting setUp thread groups
2026-08-06 07:21:08,288 INFO o.a.j.e.StandardJMeterEngine: Starting setUp ThreadGroup: 1 : Setup: Clean Results Directory 
2026-08-06 07:21:08,290 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Setup: Clean Results Directory.
2026-08-06 07:21:08,290 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-06 07:21:08,290 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=0 delayedStart=false
2026-08-06 07:21:08,293 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-08-06 07:21:08,293 INFO o.a.j.e.StandardJMeterEngine: Waiting for all setup thread groups to exit
2026-08-06 07:21:08,305 INFO o.a.j.t.JMeterThread: Thread started: Setup: Clean Results Directory 1-1
2026-08-06 07:21:08,316 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-08-06 07:21:08,316 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-08-06 07:21:08,318 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-08-06 07:21:08,318 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-08-06 07:21:10,090 INFO o.a.j.p.j.s.J.Cleanup Results Files: [SETUP] Deleted C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\scripts\results\summary.csv
2026-08-06 07:21:10,090 INFO o.a.j.p.j.s.J.Cleanup Results Files: [SETUP] Deleted C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\scripts\results\aggregate.csv
2026-08-06 07:21:10,092 INFO o.a.j.p.j.s.J.Cleanup Results Files: [SETUP] Deleted C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\scripts\results\errors.jtl
2026-08-06 07:21:10,092 INFO o.a.j.p.j.s.J.Cleanup Results Files: [SETUP] Results directory clean: scripts/results
2026-08-06 07:21:10,338 INFO o.a.j.t.JMeterThread: Thread is done: Setup: Clean Results Directory 1-1
2026-08-06 07:21:10,338 INFO o.a.j.t.JMeterThread: Thread finished: Setup: Clean Results Directory 1-1
2026-08-06 07:21:10,340 INFO o.a.j.e.StandardJMeterEngine: All Setup Threads have ended
2026-08-06 07:21:10,373 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Chatbot Load Test � 1 Users
2026-08-06 07:21:10,373 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Chatbot Load Test � 1 Users.
2026-08-06 07:21:10,373 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-06 07:21:10,373 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=2 delayedStart=false
2026-08-06 07:21:10,375 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-08-06 07:21:10,375 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-08-06 07:21:10,385 INFO o.a.j.t.JMeterThread: Thread started: Chatbot Load Test � 1 Users 1-1
2026-08-06 07:21:10,385 INFO o.a.j.s.FileServer: Stored: scripts/chatbot-prompts.csv
2026-08-06 07:21:10,678 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = WIN-CA-WKST-64
2026-08-06 07:21:10,715 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-08-06 07:21:11,547 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2026-08-06 07:21:11,557 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2026-08-06 07:21:11,557 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2026-08-06 07:21:11,698 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2026-08-06 07:21:11,704 INFO o.a.j.u.SSLManager: KeyStore created OK
2026-08-06 07:21:11,704 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2026-08-06 07:21:13,909 INFO o.a.j.e.J.Extract + Compute Chatbot Metrics: [PERF] simple_query           |   2280ms [     OK] | in=28   out=67   tps=29.4   | cost=0.000363  | stop=end_turn     | content=true
2026-08-06 07:21:18,644 INFO o.a.j.e.J.Extract + Compute Chatbot Metrics: [PERF] simple_query           |   4680ms [     OK] | in=29   out=171  tps=36.5   | cost=0.000884  | stop=end_turn     | content=true
2026-08-06 07:21:20,852 INFO o.a.j.e.J.Extract + Compute Chatbot Metrics: [PERF] simple_query           |   2204ms [     OK] | in=28   out=137  tps=62.2   | cost=0.000713  | stop=end_turn     | content=true
2026-08-06 07:21:22,673 INFO o.a.j.e.J.Extract + Compute Chatbot Metrics: [PERF] simple_query           |   1810ms [   FAST] | in=28   out=108  tps=59.7   | cost=0.000568  | stop=end_turn     | content=true
2026-08-06 07:21:25,276 INFO o.a.j.e.J.Extract + Compute Chatbot Metrics: [PERF] simple_query           |   2408ms [     OK] | in=29   out=153  tps=63.5   | cost=0.000794  | stop=end_turn     | content=true
2026-08-06 07:21:27,008 INFO o.a.j.e.J.Extract + Compute Chatbot Metrics: [PERF] simple_query           |   1726ms [   FAST] | in=29   out=106  tps=61.4   | cost=0.000559  | stop=end_turn     | content=true
2026-08-06 07:21:29,923 INFO o.a.j.e.J.Extract + Compute Chatbot Metrics: [PERF] simple_query           |   2638ms [     OK] | in=29   out=167  tps=63.3   | cost=0.000864  | stop=end_turn     | content=true
2026-08-06 07:21:31,239 INFO o.a.j.e.J.Extract + Compute Chatbot Metrics: [PERF] simple_query           |   1311ms [   FAST] | in=27   out=65   tps=49.6   | cost=0.000352  | stop=end_turn     | content=true
2026-08-06 07:21:34,358 INFO o.a.j.e.J.Extract + Compute Chatbot Metrics: [PERF] account_management     |   2430ms [     OK] | in=37   out=148  tps=60.9   | cost=0.000777  | stop=end_turn     | content=true
2026-08-06 07:21:37,043 INFO o.a.j.e.J.Extract + Compute Chatbot Metrics: [PERF] account_management     |   2680ms [     OK] | in=34   out=147  tps=54.9   | cost=0.000769  | stop=end_turn     | content=true
2026-08-06 07:21:39,343 INFO o.a.j.e.J.Extract + Compute Chatbot Metrics: [PERF] account_management     |   2295ms [     OK] | in=31   out=112  tps=48.8   | cost=0.000591  | stop=end_turn     | content=true
2026-08-06 07:21:41,797 INFO o.a.j.e.J.Extract + Compute Chatbot Metrics: [PERF] account_management     |   2448ms [     OK] | in=36   out=161  tps=65.8   | cost=0.000841  | stop=end_turn     | content=true
2026-08-06 07:21:41,797 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Chatbot Load Test � 1 Users 1-1
2026-08-06 07:21:41,799 INFO o.a.j.t.JMeterThread: Thread finished: Chatbot Load Test � 1 Users 1-1
2026-08-06 07:21:41,800 INFO o.a.j.e.StandardJMeterEngine: Starting tearDown thread groups
2026-08-06 07:21:41,800 INFO o.a.j.e.StandardJMeterEngine: Starting tearDown ThreadGroup: 1 : TearDown: Write Aggregate CSV
2026-08-06 07:21:41,801 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group TearDown: Write Aggregate CSV.
2026-08-06 07:21:41,801 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-06 07:21:41,801 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=0 delayedStart=false
2026-08-06 07:21:41,802 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-08-06 07:21:41,802 INFO o.a.j.t.JMeterThread: Thread started: TearDown: Write Aggregate CSV 1-1
2026-08-06 07:21:42,078 INFO o.a.j.p.j.s.J.W.csv: [AGG] Aggregate report written: C:\Users\Prakash.Manoharan\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\scripts\results\aggregate.csv
2026-08-06 07:21:42,080 INFO o.a.j.p.j.s.J.W.csv: [AGG] Stats cleared for next run
2026-08-06 07:21:42,080 INFO o.a.j.t.JMeterThread: Thread is done: TearDown: Write Aggregate CSV 1-1
2026-08-06 07:21:42,080 INFO o.a.j.t.JMeterThread: Thread finished: TearDown: Write Aggregate CSV 1-1
2026-08-06 07:21:42,082 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-08-06 07:21:42,082 INFO o.a.j.s.FileServer: Close: scripts/chatbot-prompts.csv
2026-08-06 07:21:42,095 INFO o.a.j.r.Summariser: summary =      3 in 00:00:34 =    0.1/s Avg:  1500 Min:   277 Max:  2449 Err:     0 (0.00%)